---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarHookRotationAtStart
source: html/ef54834b-09c2-a66e-4d57-0096237f2039.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarHookRotationAtStart Property

"Hook Rotation At Start"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarHookRotationAtStart { get; }
```